** Solution

#+begin_src fsharp :tangle "perm_missing_elem.fs"
  let solution xs =
      let elements = Set.ofList xs
      let expected = Set.ofList [1 .. (List.length xs)]
      expected - elements
      |> Set.maxElement

  solution [2; 3; 1; 5]
#+end_src

#+RESULTS:
: 4

** Solution

#+begin_src fsharp :tangle "frogjmp.fs"
  let solution startPosition finalPosition jumpSize =
      (finalPosition - startPosition) / (jumpSize)
      |> ceil
      |> int

  solution 10. 85. 30.
#+end_src

#+RESULTS:
: 3

** Solution

#+begin_src fsharp :tangle "fibFrog.fsx"
  let rec fib N =
      match N with
          | 0 -> 1
          | 1 -> 1
          | x when x >= 1 -> fib(N-1) + fib(N-2)
          | _ -> failwith "N should be >= 0!"

  let isFib x =
      seq { 0..x }
      |> Seq.exists (fib >> ((=) x))

  let canJumpBetween (xs: int array) N a b =
      (a = -1 || xs.[a] = 1) && (b = N || xs.[b] = 1) && isFib (b - a)

  // returns list of possible next states
  let evolveState currentPos xs N history =
      let candidateJumps =
          [(currentPos + 1) .. N]
      candidateJumps
      |> List.filter (canJumpBetween xs N currentPos)
      |> List.map (fun x -> (x, x::history))

  let rec f (states: (int * (int list)) list) xs N (solutions: int list list) : int list list =
      match states with
          | (currentPosition, history) :: tail ->
              let newStates = evolveState currentPosition xs N history
              let newSolutions = if currentPosition = N then (history)::solutions else solutions
              f (newStates @ tail) xs N newSolutions
          | [] ->
              solutions

  let solution xs =
      let N = Array.length xs
      f [(-1, [-1])] xs N []
      |> List.map List.rev


  let solution2 xs =
      xs
      |> solution
      |> List.map List.length
      |> List.max

  let input = [|
               1
               0
               0
               1
               1
               0
               1
               0
               0
               0
               0 |]

  solution input
#+end_src

#+RESULTS:
:   [[-1, 4, 6, 11], [-1, 0, 3, 11], [-1, 0, 3, 6, 11], [-1, 0, 3, 4, 6, 11]]
